---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamStructuralThermalTreated
source: html/bc20338a-93e9-91a4-934e-48584a4df393.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamStructuralThermalTreated Property

"Thermally Treated"

## Syntax (C#)
```csharp
public static ForgeTypeId PhyMaterialParamStructuralThermalTreated { get; }
```